bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/hal_drv/src/hal_pm.c
/*
 * Copyright (c) 2016-2023 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "hal_pm.h"
#include "bl808.h"
#include "bl808_hbn.h"
#include "bl808_pds.h"
#include "hal_flash.h"
#include "hal_rtc.h"

#define PM_PDS_GPIO_KEEP_EN       0
#define PM_HBN_GPIO_KEEP_EN       0
#define PM_PDS_FLASH_POWER_OFF    1
#define PM_PDS_DLL_POWER_OFF      1
#define PM_PDS_PLL_POWER_OFF      1
#define PM_PDS_RF_POWER_OFF       1
#define PM_PDS_LDO_LEVEL_DEFAULT  HBN_LDO_LEVEL_1P10V
#define PM_PDS_DCDC_LEVEL_DEFAULT AON_DCDC_LEVEL_1P100V
#define PM_HBN_LDO_LEVEL_DEFAULT  HBN_LDO_LEVEL_0P90V

/* Cache Way Disable, will get from l1c register */
uint8_t cacheWayDisable = 0;

/* PSRAM IO Configuration, will get from glb register */
uint32_t psramIoCfg = 0;

/* Flash offset value, will get from sf_ctrl register */
uint32_t flash_offset = 0;

SPI_Flash_Cfg_Type *flash_cfg;

static PDS_DEFAULT_LV_CFG_Type ATTR_TCM_CONST_SECTION pdsCfgLevel1 = {
    .pdsCtl = {
        .pdsStart = 1,
        .sleepForever = 0,
        .xtalForceOff = 0,
        .saveWiFiState = 0,
        .dcdc11Off = 0,
        .bgSysOff = 0,
        .ctrlGpioIePuPd = 0,
        .dcdc18Off = 1,
        .clkOff = 1,
        .memStby = 1,
        .glbRstProtect = 0,
        .isolation = 1,
        .waitXtalRdy = 0,
        .pdsPwrOff = 1,
        .xtalOff = 1,
        .socEnbForceOn = 0,
        .pdsRstSocEn = 0,
        .pdsRC32mOn = 0,
        .pdsDcdc11VselEn = 1,
        .usbpllOff = 0,
        .aupllOff = 1,
        .cpupllOff = 1,
        .wifipllOff = 1,
        .pdsDcdc11Vsel = 0x08,
        .pdsCtlRfSel = 3,
        .pdsUseTbttSlp = 0,
        .pdsGpioIsoMod = 0,
    },
    .pdsCtl2 = {
        .forceDspPwrOff = 0,
        .forceUsbPwrOff = 0,
        .forceDspIso = 0,
        .forceUsbIso = 0,
        .forceMcuPdsRst = 0,
        .forceDspPdsRst = 0,
        .forceWbPdsRst = 0,
        .forceUsbPdsRst = 0,
        .forceMcuMemStby = 0,
        .forceDspMemStby = 0,
        .forceWbMemStby = 0,
        .forceUsbMemStby = 0,
        .forceMcuGateClk = 0,
        .forceDspGateClk = 0,
        .forceWbGateClk = 0,
        .forceUsbGateClk = 0,
    },
    .pdsCtl3 = {
        .forceMiscPwrOff = 0,
        .forceMiscIsoEn = 0,
        .forceMiscPdsRst = 0,
        .forceMiscMemStby = 0,
        .forceMiscGateClk = 0,
        .DspIsoEn = 1,
        .UsbIsoEn = 0,
        .MiscIsoEn = 0,
    },
    .pdsCtl4 = {
        .mcuRst = 0,
        .mcuMemStby = 0,
        .mcuGateClk = 0,
        .dspPwrOff = 1,
        .dspRst = 1,
        .dspMemStby = 1,
        .dspGateClk = 1,
        .WbRst = 0,
        .WbMemStby = 0,
        .WbGateClk = 0,
        .usbPwrOff = 0,
        .usbRst = 0,
        .usbMemStby = 0,
        .usbGateClk = 0,
        .MiscPwrOff = 0,
        .MiscRst = 0,
        .MiscMemStby = 0,
        .MiscGateClk = 0,
    },
    .pdsCtl5 = {
        .McuWfiMask = 0,
        .DspWfiMask = 1,
        .LpWfiMask = 1,
        .ctrlUsb33 = 1,
        .pdLdo18io = 1,
        .gpioKeepEn = 7,
    }
};

static PDS_DEFAULT_LV_CFG_Type ATTR_TCM_CONST_SECTION pdsCfgLevel2 = {
    .pdsCtl = {
        .pdsStart = 1,
        .sleepForever = 0,
        .xtalForceOff = 0,
        .saveWiFiState = 0,
        .dcdc11Off = 0,
        .bgSysOff = 0,
        .ctrlGpioIePuPd = 0,
        .dcdc18Off = 1,
        .clkOff = 1,
        .memStby = 1,
        .glbRstProtect = 0,
        .isolation = 1,
        .waitXtalRdy = 0,
        .pdsPwrOff = 1,
        .xtalOff = 1,
        .socEnbForceOn = 0,
        .pdsRstSocEn = 0,
        .pdsRC32mOn = 0,
        .pdsDcdc11VselEn = 1,
        .usbpllOff = 1,
        .aupllOff = 1,
        .cpupllOff = 1,
        .wifipllOff = 1,
        .pdsDcdc11Vsel = 0x08,
        .pdsCtlRfSel = 3,
        .pdsUseTbttSlp = 0,
        .pdsGpioIsoMod = 0,
    },
    .pdsCtl2 = {
        .forceDspPwrOff = 0,
        .forceUsbPwrOff = 0,
        .forceDspIso = 0,
        .forceUsbIso = 0,
        .forceMcuPdsRst = 0,
        .forceDspPdsRst = 0,
        .forceWbPdsRst = 0,
        .forceUsbPdsRst = 0,
        .forceMcuMemStby = 0,
        .forceDspMemStby = 0,
        .forceWbMemStby = 0,
        .forceUsbMemStby = 0,
        .forceMcuGateClk = 0,
        .forceDspGateClk = 0,
        .forceWbGateClk = 0,
        .forceUsbGateClk = 0,
    },
    .pdsCtl3 = {
        .forceMiscPwrOff = 0,
        .forceMiscIsoEn = 0,
        .forceMiscPdsRst = 0,
        .forceMiscMemStby = 0,
        .forceMiscGateClk = 0,
        .DspIsoEn = 0,
        .UsbIsoEn = 1,
        .MiscIsoEn = 0,
    },
    .pdsCtl4 = {
        .mcuRst = 0,
        .mcuMemStby = 0,
        .mcuGateClk = 0,
        .dspPwrOff = 0,
        .dspRst = 0,
        .dspMemStby = 0,
        .dspGateClk = 0,
        .WbRst = 0,
        .WbMemStby = 0,
        .WbGateClk = 0,
        .usbPwrOff = 1,
        .usbRst = 1,
        .usbMemStby = 1,
        .usbGateClk = 1,
        .MiscPwrOff = 0,
        .MiscRst = 0,
        .MiscMemStby = 0,
        .MiscGateClk = 0,
    },
    .pdsCtl5 = {
        .McuWfiMask = 0,
        .DspWfiMask = 1,
        .LpWfiMask = 1,
        .ctrlUsb33 = 1,
        .pdLdo18io = 1,
        .gpioKeepEn = 7,
    }
};

static PDS_DEFAULT_LV_CFG_Type ATTR_TCM_CONST_SECTION pdsCfgLevel3 = {
    .pdsCtl = {
        .pdsStart = 1,
        .sleepForever = 0,
        .xtalForceOff = 0,
        .saveWiFiState = 0,
        .dcdc11Off = 0,
        .bgSysOff = 0,
        .ctrlGpioIePuPd = 0,
        .dcdc18Off = 1,
        .clkOff = 1,
        .memStby = 1,
        .glbRstProtect = 0,
        .isolation = 1,
        .waitXtalRdy = 0,
        .pdsPwrOff = 1,
        .xtalOff = 1,
        .socEnbForceOn = 0,
        .pdsRstSocEn = 0,
        .pdsRC32mOn = 0,
        .pdsDcdc11VselEn = 1,
        .usbpllOff = 1,
        .aupllOff = 1,
        .cpupllOff = 1,
        .wifipllOff = 1,
        .pdsDcdc11Vsel = 0x08,
        .pdsCtlRfSel = 3,
        .pdsUseTbttSlp = 0,
        .pdsGpioIsoMod = 0,
    },
    .pdsCtl2 = {
        .forceDspPwrOff = 0,
        .forceUsbPwrOff = 0,
        .forceDspIso = 0,
        .forceUsbIso = 0,
        .forceMcuPdsRst = 0,
        .forceDspPdsRst = 0,
        .forceWbPdsRst = 0,
        .forceUsbPdsRst = 0,
        .forceMcuMemStby = 0,
        .forceDspMemStby = 0,
        .forceWbMemStby = 0,
        .forceUsbMemStby = 0,
        .forceMcuGateClk = 0,
        .forceDspGateClk = 0,
        .forceWbGateClk = 0,
        .forceUsbGateClk = 0,
    },
    .pdsCtl3 = {
        .forceMiscPwrOff = 0,
        .forceMiscIsoEn = 0,
        .forceMiscPdsRst = 0,
        .forceMiscMemStby = 0,
        .forceMiscGateClk = 0,
        .DspIsoEn = 1,
        .UsbIsoEn = 1,
        .MiscIsoEn = 0,
    },
    .pdsCtl4 = {
        .mcuRst = 0,
        .mcuMemStby = 0,
        .mcuGateClk = 0,
        .dspPwrOff = 1,
        .dspRst = 1,
        .dspMemStby = 1,
        .dspGateClk = 1,
        .WbRst = 0,
        .WbMemStby = 0,
        .WbGateClk = 0,
        .usbPwrOff = 1,
        .usbRst = 1,
        .usbMemStby = 1,
        .usbGateClk = 1,
        .MiscPwrOff = 0,
        .MiscRst = 0,
        .MiscMemStby = 0,
        .MiscGateClk = 0,
    },
    .pdsCtl5 = {
        .McuWfiMask = 0,
        .DspWfiMask = 1,
        .LpWfiMask = 1,
        .ctrlUsb33 = 1,
        .pdLdo18io = 1,
        .gpioKeepEn = 7,
    }
};

static PDS_DEFAULT_LV_CFG_Type ATTR_TCM_CONST_SECTION pdsCfgLevel7 = {
    .pdsCtl = {
        .pdsStart = 1,
        .sleepForever = 0,
        .xtalForceOff = 1,
        .saveWiFiState = 0,
        .dcdc11Off = 1,
        .bgSysOff = 1,
        .ctrlGpioIePuPd = 0,
        .dcdc18Off = 1,
        .clkOff = 1,
        .memStby = 1,
        .glbRstProtect = 0,
        .isolation = 1,
        .waitXtalRdy = 0,
        .pdsPwrOff = 1,
        .xtalOff = 1,
        .socEnbForceOn = 0,
        .pdsRstSocEn = 0,
        .pdsRC32mOn = 0,
        .pdsDcdc11VselEn = 0,
        .usbpllOff = 1,
        .aupllOff = 1,
        .cpupllOff = 1,
        .wifipllOff = 1,
        .pdsDcdc11Vsel = 0,
        .pdsCtlRfSel = 1,
        .pdsUseTbttSlp = 0,
        .pdsGpioIsoMod = 1,
    },
    .pdsCtl2 = {
        .forceDspPwrOff = 0,
        .forceUsbPwrOff = 0,
        .forceDspIso = 0,
        .forceUsbIso = 0,
        .forceMcuPdsRst = 0,
        .forceDspPdsRst = 0,
        .forceWbPdsRst = 0,
        .forceUsbPdsRst = 0,
        .forceMcuMemStby = 0,
        .forceDspMemStby = 0,
        .forceWbMemStby = 0,
        .forceUsbMemStby = 0,
        .forceMcuGateClk = 0,
        .forceDspGateClk = 0,
        .forceWbGateClk = 0,
        .forceUsbGateClk = 0,
    },
    .pdsCtl3 = {
        .forceMiscPwrOff = 0,
        .forceMiscIsoEn = 0,
        .forceMiscPdsRst = 0,
        .forceMiscMemStby = 0,
        .forceMiscGateClk = 0,
        .DspIsoEn = 1,
        .UsbIsoEn = 1,
        .MiscIsoEn = 1,
    },
    .pdsCtl4 = {
        .mcuRst = 1,
        .mcuMemStby = 1,
        .mcuGateClk = 1,
        .dspPwrOff = 1,
        .dspRst = 1,
        .dspMemStby = 1,
        .dspGateClk = 1,
        .WbRst = 1,
        .WbMemStby = 1,
        .WbGateClk = 1,
        .usbPwrOff = 1,
        .usbRst = 1,
        .usbMemStby = 1,
        .usbGateClk = 1,
        .MiscPwrOff = 1,
        .MiscRst = 1,
        .MiscMemStby = 1,
        .MiscGateClk = 1,
    },
    .pdsCtl5 = {
        .McuWfiMask = 0,
        .DspWfiMask = 1,
        .LpWfiMask = 1,
        .ctrlUsb33 = 1,
        .pdLdo18io = 1,
        .gpioKeepEn = 0,
    }
};

static void pm_hbn_rtc_rst_disable(void)
{
    HBN_RTC_MISC_Type rtcMiscCfg;

    HBN_Get_RTC_Misc_Cfg(&rtcMiscCfg);
    rtcMiscCfg.rtcRstEnRtc = 0;
    HBN_Set_RTC_Misc_Cfg(&rtcMiscCfg);
}

