bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/hal_drv/src/hal_pm.c
/******************************************************************************
 * @brief  set power down sleep VDDCORE gpio interrupt mask
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
static BL_Err_Type pm_clr_pds_gpio_int(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_INT);
    // PDS_GPIO_INT_SET_1_GPIO0_GPIO7:
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_GPIO_SET1_INT_CLR);
    // PDS_GPIO_INT_SET_2_GPIO8_16_GPIO22:
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_GPIO_SET2_INT_CLR);
    // PDS_GPIO_INT_SET_3_GPIO23_GPIO30:
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_GPIO_SET3_INT_CLR);
    // PDS_GPIO_INT_SET_4_GPIO31_GPIO38:
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_GPIO_SET4_INT_CLR);

    BL_WR_REG(PDS_BASE, PDS_GPIO_INT, tmpVal);
    return SUCCESS;
}

void pm_pds_mask_all_wakeup_src(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_WAKEUP_SRC_EN);
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);
}

static void pm_pds_intc_clr(void)
{
    pm_clr_pds_gpio_int();
    PDS_IntClear();
}

/**
 * @brief power management in pds(power down sleep) mode
 *
 * cpu's behavior after wakeup depend on psd level,see flow table if cpu off ,
 * cpu will reset after wakeup
 *
 *      PD_AON_RTC  PD_AON   PD_AON_HBNCORE  PD_CORE  PD_CORE_MISC PD_USB PD_DSP
 * PDS0    ON          ON         ON            ON        ON         ON     ON
 * PDS1    ON          ON         ON            ON        ON         ON     OFF
 * PDS2    ON          ON         ON            ON        ON         OFF    ON
 * PDS3    ON          ON         ON            ON        ON         OFF    OFF
 * PDS7    ON          ON         ON            ON        OFF        OFF    OFF
 */
void ATTR_TCM_SECTION pm_pds_mode_enter(enum pm_pds_sleep_level pds_level,
                                        uint32_t sleep_time)
{
    PDS_DEFAULT_LV_CFG_Type *pPdsCfg = NULL;
    uint32_t tmpVal;
    uint32_t flash_cfg_len;
    uint32_t pds_ram1;
    uint32_t pds_ram2;

    /* To make it simple and safe*/
    cpu_global_irq_disable();

    pm_hbn_rtc_rst_disable();

    flash_get_cfg((uint8_t **)&flash_cfg, &flash_cfg_len);

    HBN_Set_Ldo11_All_Vout(PM_PDS_LDO_LEVEL_DEFAULT);
    AON_Set_DCDC11_Top_Vout(PM_PDS_DCDC_LEVEL_DEFAULT);
    /************************ PDS INT SET ***********************/
    // PDS_WAKEUP_IRQHandler_Install();
    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0xffffffff);
    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);

    if (sleep_time) {
        tmpVal |= (1 << 10); // unmask pds sleep time wakeup
    }

    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    /* clear all interrupt status */
    pm_pds_intc_clr();

    /* enable PDS interrupt to wakeup CPU (PDS1:CPU not powerdown, CPU __WFI)*/
    pm_pds_irq_register();
    /***********************************************************/

    switch (pds_level) {
        case PM_PDS_LEVEL_1:
            pPdsCfg = &pdsCfgLevel1;
            break;
        case PM_PDS_LEVEL_2:
            pPdsCfg = &pdsCfgLevel2;
            break;
        case PM_PDS_LEVEL_3:
            pPdsCfg = &pdsCfgLevel3;
            break;
        case PM_PDS_LEVEL_7:
            pPdsCfg = &pdsCfgLevel7;
            break;
        default:
            return;
    }

#if PM_PDS_FLASH_POWER_OFF
    uint32_t sw_cfg0 = 0;
    SF_Ctrl_Pin_Select sf_pin_select = 0;

    /* get sw uasge 0 */
    EF_Ctrl_Read_Sw_Usage(0, (uint32_t *)&sw_cfg0);
    sf_pin_select = (tmpVal >> 14) & 0x3f;
    flash_get_cfg((uint8_t **)&flash_cfg, &flash_cfg_len);

    HBN_Power_Down_Flash(flash_cfg);

    /* LDO_FLASH Pull down */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO18FLASH);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_PU_LDO18FLASH);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_LDO18FLASH_PULLDOWN);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_LDO18FLASH_PULLDOWN_SEL);
    BL_WR_REG(GLB_BASE, GLB_LDO18FLASH, tmpVal);

    /* Turn Off Flash PAD IE */
    /* GPIO46~51 */
    for (int i = 0; i < 6; i++) {
        BL_WR_WORD(GLB_BASE + GLB_GPIO_CFG46_OFFSET + i * 4, 0);
    }

    /* Turn Off PSRAM PAD IE */
    /* GPIO52~63 */
    for (int i = 0; i < 12; i++) {
        BL_WR_WORD(GLB_BASE + GLB_GPIO_CFG52_OFFSET + i * 4, 0);
    }
#endif

#if PM_PDS_GPIO_KEEP_EN
    pPdsCfg->pdsCtl.pdsGpioIsoMod = 1;
    pPdsCfg->pdsCtl5.gpioKeepEn = 7;
#endif

#if PM_PDS_PLL_POWER_OFF
    /*************************** Clock Config **************************/
    GLB_Set_MCU_System_CLK(GLB_MCU_SYS_CLK_RC32M); // MCU CLK SELECT RC32M
    GLB_Set_DSP_System_CLK(GLB_DSP_SYS_CLK_RC32M);

    GLB_Power_Off_WAC_PLL(GLB_WAC_PLL_CPUPLL);
    GLB_Power_Off_WAC_PLL(GLB_WAC_PLL_WIFIPLL);
    GLB_Power_Off_WAC_PLL(GLB_WAC_PLL_AUPLL);

    /* Power Down Mipi PLL */
    GLB_Power_Off_MU_PLL(GLB_MU_PLL_MIPIPLL);
    /* Power Down UHS(PSRAM) PLL */
    GLB_Power_Off_MU_PLL(GLB_MU_PLL_UHSPLL);

    // GLB_Set_SF_CLK(1, GLB_SFLASH_CLK_BCLK, 0);
    tmpVal = BL_RD_REG(PDS_BASE, PDS_PU_RST_CLKPLL);
    tmpVal |= (0x3 << 9);
    BL_WR_REG(PDS_BASE, PDS_PU_RST_CLKPLL, tmpVal);
    /**************************************************************/
#endif

#if PM_PDS_RF_POWER_OFF == 0
    pPdsCfg->pdsCtl.pdsCtlRfSel = 0;
#endif

    if (0xFFFFFFFF != BL_RD_REG(PDS_BASE, PDS_GPIO_PD_SET)) {
        pPdsCfg->pdsCtl.ctrlGpioIePuPd = 1;
    }

    /* LDO12_UHS Pull down */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO12UHS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_PU_LDO12UHS);
    BL_WR_REG(GLB_BASE, GLB_LDO12UHS, tmpVal);

    /* LDO15_CIS Pull down */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO15CIS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_PU_LDO15CIS);
    BL_WR_REG(GLB_BASE, GLB_LDO15CIS, tmpVal);

    /* DCDC18 Pull down When disable */
    tmpVal = BL_RD_REG(AON_BASE, AON_DCDC18_TOP_1);
    tmpVal = BL_SET_REG_BIT(tmpVal, AON_DCDC18_PULLDOWN_AON);
    BL_WR_REG(AON_BASE, AON_DCDC18_TOP_1, tmpVal);

    /* LDO28_CIS Pull down */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO28CIS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_PU_LDO28CIS);
    BL_WR_REG(GLB_BASE, GLB_LDO28CIS, tmpVal);

    pds_ram1 = BL_RD_REG(PDS_BASE, PDS_RAM1);
    pds_ram2 = BL_RD_REG(PDS_BASE, PDS_RAM2);

    /* PD_CORE's SRAM Clock Gating During PDS Mode */
    pds_ram1 |= (1 << 31);

    if (pds_level == PM_PDS_LEVEL_7) {
        pds_ram1 &= ~(0xf < 4);   // ocram retention
        pds_ram1 |= 0xf;          // ocram sleep
        pds_ram2 &= ~(0x3ff < 9); // wram retention
        pds_ram2 |= (0x380 < 9);  // wram retention
        pds_ram2 &= ~0x3ff;
        pds_ram2 |= 0x7f; // wram sleep
    }

    PDS_Default_Level_Config(pPdsCfg, (PDS_CTRL_RAM1_Type *)&pds_ram1,
                             (PDS_CTRL_RAM2_Type *)&pds_ram2, sleep_time);

    __WFI();

    /****************************** Wakeup Flow *******************************/
    HBN_Set_Ldo11_All_Vout(HBN_LDO_LEVEL_1P10V);
    AON_Set_DCDC11_Top_Vout(AON_DCDC_LEVEL_1P100V);

    /* LDO28_CIS Pull On */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO28CIS);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_PU_LDO28CIS);
    BL_WR_REG(GLB_BASE, GLB_LDO28CIS, tmpVal);

    /* DCDC18 Pull On*/
    tmpVal = BL_RD_REG(AON_BASE, AON_DCDC18_TOP_1);
    tmpVal = BL_CLR_REG_BIT(tmpVal, AON_DCDC18_PULLDOWN_AON);
    BL_WR_REG(AON_BASE, AON_DCDC18_TOP_1, tmpVal);

