bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/hal_drv/src/hal_pm.c
    /* LDO15_CIS Pull On */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO15CIS);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_PU_LDO15CIS);
    BL_WR_REG(GLB_BASE, GLB_LDO15CIS, tmpVal);

    /* LDO12_UHS Pull On */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO12UHS);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_PU_LDO12UHS);
    BL_WR_REG(GLB_BASE, GLB_LDO12UHS, tmpVal);

#if PM_PDS_PLL_POWER_OFF
    GLB_Power_On_XTAL_And_PLL_CLK(GLB_XTAL_40M, GLB_PLL_WIFIPLL);
    GLB_Set_MCU_System_CLK(GLB_MCU_SYS_CLK_WIFIPLL_320M);
    GLB_Set_DSP_System_CLK(GLB_DSP_SYS_CLK_CPUPLL_400M);
#endif

#if PM_PDS_FLASH_POWER_OFF
    if (pds_level <= PM_PDS_LEVEL_3) {
        /* Init flash gpio */
        SF_Cfg_Init_Ext_Flash_Gpio(0);
        SF_Cfg_Init_Flash_Gpio(sf_pin_select, 1);
        SF_Ctrl_Set_Owner(SF_CTRL_OWNER_SAHB);
        SFlash_Restore_From_Powerdown(flash_cfg, 0, SF_CTRL_FLASH_BANK0);
    }
#endif

    cpu_global_irq_enable();
}

/**
 * @brief
 *
 * power management in hbn(hibernation) mode
 * cpu will reset after wakeup
 *
 * HBN_LEVEL PD_AON_RTC PD_AON PD_AON_HBNCORE PD_CORE&PD_CORE_MISC&PD_USB&PD_MM
 * HBN0          ON       ON        ON                     OFF
 * HBN1          ON       ON        OFF                    OFF
 * HBN2          ON       OFF       OFF                    OFF
 *
 * @param hbn_level
 */
void ATTR_TCM_SECTION pm_hbn_mode_enter(enum pm_hbn_sleep_level hbn_level,
                                        uint8_t sleep_time)
{
    uint32_t tmpVal;

    /* To make it simple and safe*/
    cpu_global_irq_disable();

    CPU_Interrupt_Pending_Clear(HBN_OUT0_IRQn);
    CPU_Interrupt_Pending_Clear(HBN_OUT1_IRQn);

    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0xffffffff);
    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0);

    if (sleep_time) {
        rtc_init(sleep_time); // sleep time,unit is second
    }

    if (hbn_level >= PM_HBN_LEVEL_2) {
        HBN_PD_RC32K_In_Poff();
    }

#if PM_PDS_FLASH_POWER_OFF
    HBN_Power_Down_Flash(NULL);
#endif

#if PM_HBN_GPIO_KEEP_EN
    tmpVal = BL_RD_REG(HBN_BASE, HBN_PAD_CTRL_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_REG_AON_GPIO_ISO_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_REG_EN_AON_CTRL_GPIO);
    BL_WR_REG(HBN_BASE, HBN_PAD_CTRL_0, tmpVal);
#endif

    /* Select RC32M */
    // GLB_Set_System_CLK(GLB_DLL_XTAL_NONE, GLB_SYS_CLK_RC32M);
    GLB_Set_MCU_System_CLK(GLB_MCU_SYS_CLK_RC32M);
    /* power off pll */
    GLB_Power_Off_MU_PLL(GLB_MU_PLL_MIPIPLL);
    GLB_Power_Off_MU_PLL(GLB_MU_PLL_UHSPLL);
    /* power off xtal */
    AON_Power_Off_XTAL();

    /* HBN mode LDO level */
    tmpVal = BL_RD_REG(HBN_BASE, HBN_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_LDO11_AON_VOUT_SEL,
                                 PM_HBN_LDO_LEVEL_DEFAULT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_LDO11_RT_VOUT_SEL,
                                 PM_HBN_LDO_LEVEL_DEFAULT);
    BL_WR_REG(HBN_BASE, HBN_CTL, tmpVal);

    /* Set HBN flag */
    BL_WR_REG(HBN_BASE, HBN_RSV0, HBN_STATUS_ENTER_FLAG);

    tmpVal = BL_RD_REG(HBN_BASE, HBN_CTL);

    /* Set HBN level, (HBN_PWRDN_HBN_RAM not use) */
    if (hbn_level < PM_HBN_LEVEL_1) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PWRDN_HBN_CORE);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PWRDN_HBN_CORE);
    }

    /* Set power on option:0 for por reset twice for robust 1 for reset only
   * once*/
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PWR_ON_OPTION);
    BL_WR_REG(HBN_BASE, HBN_CTL, tmpVal);

    /* Enable HBN mode */
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_MODE);
    BL_WR_REG(HBN_BASE, HBN_CTL, tmpVal);

    while (1) {
        arch_delay_ms(100);
        GLB_SW_POR_Reset();
    }
}

void pm_hbn_out0_irq_register(void)
{
    Interrupt_Handler_Register(HBN_OUT0_IRQn, HBN_OUT0_IRQ);
    CPU_Interrupt_Enable(HBN_OUT0_IRQn);
}

void pm_hbn_out1_irq_register(void)
{
    Interrupt_Handler_Register(HBN_OUT1_IRQn, HBN_OUT1_IRQ);
    CPU_Interrupt_Enable(HBN_OUT1_IRQn);
}

void HBN_OUT0_IRQ(void)
{
    if (SET == HBN_Get_INT_State(HBN_INT_GPIO9)) {
        HBN_Clear_IRQ(HBN_INT_GPIO9);
        pm_irq_callback(PM_HBN_GPIO9_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO10)) {
        HBN_Clear_IRQ(HBN_INT_GPIO10);
        pm_irq_callback(PM_HBN_GPIO10_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO11)) {
        HBN_Clear_IRQ(HBN_INT_GPIO11);
        pm_irq_callback(PM_HBN_GPIO11_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO12)) {
        HBN_Clear_IRQ(HBN_INT_GPIO12);
        pm_irq_callback(PM_HBN_GPIO12_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO13)) {
        HBN_Clear_IRQ(HBN_INT_GPIO13);
        pm_irq_callback(PM_HBN_GPIO13_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO14)) {
        HBN_Clear_IRQ(HBN_INT_GPIO14);
        pm_irq_callback(PM_HBN_GPIO14_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO15)) {
        HBN_Clear_IRQ(HBN_INT_GPIO15);
        pm_irq_callback(PM_HBN_GPIO15_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO40)) {
        HBN_Clear_IRQ(HBN_INT_GPIO40);
        pm_irq_callback(PM_HBN_GPIO40_WAKEUP_EVENT);
    } else if (SET == HBN_Get_INT_State(HBN_INT_GPIO41)) {
        HBN_Clear_IRQ(HBN_INT_GPIO41);
        pm_irq_callback(PM_HBN_GPIO41_WAKEUP_EVENT);
    } else {
        HBN_Clear_IRQ(HBN_INT_RTC);
        HBN_Clear_RTC_INT();
        pm_irq_callback(PM_HBN_RTC_WAKEUP_EVENT);
    }
}

void ATTR_TCM_SECTION HBN_OUT1_IRQ(void)
{
    /* PIR */
    if (SET == HBN_Get_INT_State(HBN_INT_PIR)) {
        HBN_Clear_IRQ(HBN_INT_PIR);
    }
    /* BOR */
    else if (SET == HBN_Get_INT_State(HBN_INT_BOD)) {
        HBN_Clear_IRQ(HBN_INT_BOD);
        pm_irq_callback(PM_HBN_BOD_WAKEUP_EVENT);
    }
    /* ACOMP0 */
    else if (SET == HBN_Get_INT_State(HBN_INT_ACOMP0)) {
        HBN_Clear_IRQ(HBN_INT_ACOMP0);
        pm_irq_callback(PM_HBN_ACOMP0_WAKEUP_EVENT);
    }
    /* ACOMP1 */
    else if (SET == HBN_Get_INT_State(HBN_INT_ACOMP1)) {
        HBN_Clear_IRQ(HBN_INT_ACOMP1);
        pm_irq_callback(PM_HBN_ACOMP1_WAKEUP_EVENT);
    }
}

__WEAK void pm_irq_callback(enum pm_event_type event)
{
}

void pm_pds_irq_register(void)
{
    Interrupt_Handler_Register(PDS_WAKEUP_IRQn, PDS_WAKEUP_IRQ);
    CPU_Interrupt_Enable(PDS_WAKEUP_IRQn);
}

void ATTR_TCM_SECTION PDS_WAKEUP_IRQ(void)
{
    /* WAKE INT */
    if (SET == PDS_Get_IntStatus(PDS_INT_WAKEUP)) {
    }
    /* RF DONE */
    else if (SET == PDS_Get_IntStatus(PDS_INT_RF_DONE)) {
    }
    /* WIFI_TBTT_SLEEP */
    else if (SET == PDS_Get_IntStatus(PDS_INT_WIFI_TBTT_SLEEP)) {
    }
    /* WIFI_TBTT_WAKEUP */
    else if (SET == PDS_Get_IntStatus(PDS_INT_WIFI_TBTT_WAKEUP)) {
    }

    PDS_IntClear();
}
